Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
                      }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-postprocessor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-postprocessor-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-postprocessor"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-postprocessor-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-postprocessor"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Filters, sorts, and indexes the results of pharmcat"
      + filename                       = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.zip"
      + function_name                  = "pgxflow-backend-postprocessor"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.zip"
          + "timestamp" = "1750300213549415200"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-preprocessor"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-preprocessor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-preprocessor-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-preprocessor"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-preprocessor-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-preprocessor"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Preprocesses VCFs for Pharmcat"
      + function_name                  = "pgxflow-backend-preprocessor"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-pharmcat-sendJobEmail"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-pharmcat-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-sendJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-sendJobEmail"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-sendJobEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-sendJobEmail"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = "builds/4e5110a4935f23d273794b201824a97911b3ea269bd57208a7cdb09d3180acd1.zip"
      + function_name                  = "pgxflow-backend-pharmcat-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4e5110a4935f23d273794b201824a97911b3ea269bd57208a7cdb09d3180acd1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4e5110a4935f23d273794b201824a97911b3ea269bd57208a7cdb09d3180acd1.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/4e5110a4935f23d273794b201824a97911b3ea269bd57208a7cdb09d3180acd1.zip"
          + "timestamp" = "1750300213459579000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-pharmcat-updateReferenceFiles"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-pharmcat-updateReferenceFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-updateReferenceFiles-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-pharmcat-updateReferenceFiles-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-pharmcat-updateReferenceFiles"
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Updates PharmCAT references and logs software versions"
      + filename                       = "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip"
      + function_name                  = "pgxflow-backend-pharmcat-updateReferenceFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip"
          + "timestamp" = "1750300212248422000"
        }
    }

Plan: 1087 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + admin_login_command  = (known after apply)
  + api_url              = (known after apply)
  + beacon_ui_url        = (known after apply)
  + cognito_client_id    = (known after apply)
  + cognito_user_pool_id = (known after apply)
  + guest_login_command  = (known after apply)
module.pgxflow[0].null_resource.init_script: Creating...
module.sbeacon.null_resource.init_script: Creating...
module.sbeacon.null_resource.init_script: Provisioning with 'local-exec'...
module.sbeacon.null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.pgxflow[0].null_resource.init_script: Provisioning with 'local-exec'...
module.pgxflow[0].null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.sbeacon.null_resource.init_script (local-exec): Running init.sh in sbeacon
module.pgxflow[0].null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow
module.pgxflow[0].null_resource.init_script (local-exec): + LIBRARIES=/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries
module.pgxflow[0].null_resource.init_script (local-exec): + SOURCE=/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries/source
module.pgxflow[0].null_resource.init_script (local-exec): + '[' -d /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries ']'
module.pgxflow[0].null_resource.init_script (local-exec): + rm -rf /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries
module.sbeacon.null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon
module.sbeacon.null_resource.init_script (local-exec): + LIBRARIES=/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries
module.sbeacon.null_resource.init_script (local-exec): + SOURCE=/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + '[' -d /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries ']'
module.sbeacon.null_resource.init_script (local-exec): + rm -rf /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries
module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0]: Creating...
module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/security-sendSecurityAlert]
module.pgxflow[0].null_resource.init_script (local-exec): + mkdir /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries
module.pgxflow[0].null_resource.init_script (local-exec): + mkdir /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries/source
module.pgxflow[0].null_resource.init_script (local-exec): + cd /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries/source
module.pgxflow[0].null_resource.init_script (local-exec): + git clone --recursive --depth 1 --branch develop https://github.com/samtools/htslib.git
module.pgxflow[0].null_resource.init_script (local-exec): Cloning into 'htslib'...
module.sbeacon.null_resource.init_script (local-exec): + mkdir /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries
module.sbeacon.null_resource.init_script (local-exec): + mkdir /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + cd /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + wget https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.sbeacon.null_resource.init_script (local-exec): --2025-06-19 09:30:37--  https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0]: Creating...
module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0]: Creating...
aws_backup_vault.gaspi_backup_vault: Creating...
module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_rule.update_references_trigger: Creating...
module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_rule.update_references_trigger: Creating...
module.pgxflow[0].aws_s3_bucket.lambda-layers-bucket: Creating...
module.pgxflow[0].aws_s3_bucket.pgxflow-references: Creating...
module.sbeacon.null_resource.init_script (local-exec): Resolving github.com (github.com)... 20.205.243.166
module.sbeacon.null_resource.init_script (local-exec): Connecting to github.com (github.com)|20.205.243.166|:443... connected.
module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_rule.update_references_trigger: Creation complete after 0s [id=lookup_update_references_trigger]
module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_rule.update_references_trigger: Creation complete after 0s [id=pharmcat_update_references_trigger]
module.pgxflow[0].aws_api_gateway_rest_api.PgxApi: Creating...
module.pgxflow[0].aws_cloudfront_origin_request_policy.api: Creating...
module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0]: Creation complete after 0s [id=svep-qcfigures-lambda-containers]
module.pgxflow[0].aws_cloudfront_cache_policy.api: Creating...
module.sbeacon.null_resource.init_script (local-exec): HTTP request sent, awaiting response...
aws_backup_vault.gaspi_backup_vault: Creation complete after 1s [id=gaspi_backup_vault]
module.pgxflow[0].aws_dynamodb_table.pgxflow_references: Creating...
module.sbeacon.null_resource.init_script (local-exec): 302 Found
module.sbeacon.null_resource.init_script (local-exec): Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250619%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250619T023037Z&X-Amz-Expires=300&X-Amz-Signature=7cc3be137e6c127616a0899813117202fe77c3e3dc05238baa6b3346c428bc29&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream [following]
module.sbeacon.null_resource.init_script (local-exec): --2025-06-19 09:30:37--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250619%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250619T023037Z&X-Amz-Expires=300&X-Amz-Signature=7cc3be137e6c127616a0899813117202fe77c3e3dc05238baa6b3346c428bc29&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream
module.sbeacon.null_resource.init_script (local-exec): Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
module.sbeacon.null_resource.init_script (local-exec): Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.108.133|:443... connected.
module.sbeacon.null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.sbeacon.null_resource.init_script (local-exec): 200 OK
module.sbeacon.null_resource.init_script (local-exec): Length: 4781943 (4.6M) [application/octet-stream]
module.sbeacon.null_resource.init_script (local-exec): Saving to: ‘htslib-1.21.tar.bz2’

module.sbeacon.null_resource.init_script (local-exec):      0K .......... .......... .......... .......... ..........  1% 2.43M 2s
module.sbeacon.null_resource.init_script (local-exec):     50K .......... .......... .......... .......... ..........  2% 3.51M 2s
module.sbeacon.null_resource.init_script (local-exec):    100K .......... .......... .......... .......... ..........  3% 13.7M 1s
module.sbeacon.null_resource.init_script (local-exec):    150K .......... .......... .......... .......... ..........  4% 13.4M 1s
module.sbeacon.null_resource.init_script (local-exec):    200K .......... .......... .......... .......... ..........  5% 5.26M 1s
module.sbeacon.null_resource.init_script (local-exec):    250K .......... .......... .......... .......... ..........  6% 17.4M 1s
module.sbeacon.null_resource.init_script (local-exec):    300K .......... .......... .......... .......... ..........  7% 25.5M 1s
module.sbeacon.null_resource.init_script (local-exec):    350K .......... .......... .......... .......... ..........  8% 18.8M 1s
module.sbeacon.null_resource.init_script (local-exec):    400K .......... .......... .......... .......... ..........  9% 44.9M 1s
module.sbeacon.null_resource.init_script (local-exec):    450K .......... .......... .......... .......... .......... 10% 57.5M 0s
module.sbeacon.null_resource.init_script (local-exec):    500K .......... .......... .......... .......... .......... 11% 6.19M 1s
module.sbeacon.null_resource.init_script (local-exec):    550K .......... .......... .......... .......... .......... 12% 30.0M 0s
module.sbeacon.null_resource.init_script (local-exec):    600K .......... .......... .......... .......... .......... 13% 47.3M 0s
module.sbeacon.null_resource.init_script (local-exec):    650K .......... .......... .......... .......... .......... 14% 50.1M 0s
module.sbeacon.null_resource.init_script (local-exec):    700K .......... .......... .......... .......... .......... 16% 36.3M 0s
module.sbeacon.null_resource.init_script (local-exec):    750K .......... .......... .......... .......... .......... 17% 93.8M 0s
module.sbeacon.null_resource.init_script (local-exec):    800K .......... .......... .......... .......... .......... 18% 31.9M 0s
module.sbeacon.null_resource.init_script (local-exec):    850K .......... .......... .......... .......... .......... 19% 57.1M 0s
module.sbeacon.null_resource.init_script (local-exec):    900K .......... .......... .......... .......... .......... 20% 57.8M 0s
module.sbeacon.null_resource.init_script (local-exec):    950K .......... .......... .......... .......... .......... 21%  239M 0s
module.sbeacon.null_resource.init_script (local-exec):   1000K .......... .......... .......... .......... .......... 22% 6.68M 0s
module.sbeacon.null_resource.init_script (local-exec):   1050K .......... .......... .......... .......... .......... 23%  121M 0s
module.sbeacon.null_resource.init_script (local-exec):   1100K .......... .......... .......... .......... .......... 24% 29.4M 0s
module.sbeacon.null_resource.init_script (local-exec):   1150K .......... .......... .......... .......... .......... 25%  122M 0s
module.sbeacon.null_resource.init_script (local-exec):   1200K .......... .......... .......... .......... .......... 26%  230M 0s
module.sbeacon.null_resource.init_script (local-exec):   1250K .......... .......... .......... .......... .......... 27% 71.6M 0s
module.sbeacon.null_resource.init_script (local-exec):   1300K .......... .......... .......... .......... .......... 28% 68.7M 0s
module.sbeacon.null_resource.init_script (local-exec):   1350K .......... .......... .......... .......... .......... 29% 53.0M 0s
module.sbeacon.null_resource.init_script (local-exec):   1400K .......... .......... .......... .......... .......... 31%  310M 0s
module.sbeacon.null_resource.init_script (local-exec):   1450K .......... .......... .......... .......... .......... 32%  108M 0s
module.sbeacon.null_resource.init_script (local-exec):   1500K .......... .......... .......... .......... .......... 33% 86.6M 0s
module.sbeacon.null_resource.init_script (local-exec):   1550K .......... .......... .......... .......... .......... 34% 76.0M 0s
module.sbeacon.null_resource.init_script (local-exec):   1600K .......... .......... .......... .......... .......... 35% 62.6M 0s
module.sbeacon.null_resource.init_script (local-exec):   1650K .......... .......... .......... .......... .......... 36%  272M 0s
module.sbeacon.null_resource.init_script (local-exec):   1700K .......... .......... .......... .......... .......... 37%  139M 0s
module.sbeacon.null_resource.init_script (local-exec):   1750K .......... .......... .......... .......... .......... 38% 89.2M 0s
module.sbeacon.null_resource.init_script (local-exec):   1800K .......... .......... .......... .......... .......... 39%  100M 0s
module.sbeacon.null_resource.init_script (local-exec):   1850K .......... .......... .......... .......... .......... 40%  301M 0s
module.sbeacon.null_resource.init_script (local-exec):   1900K .......... .......... .......... .......... .......... 41%  100M 0s
module.sbeacon.null_resource.init_script (local-exec):   1950K .......... .......... .......... .......... .......... 42%  102M 0s
module.sbeacon.null_resource.init_script (local-exec):   2000K .......... .......... .......... .......... .......... 43% 7.67M 0s
module.sbeacon.null_resource.init_script (local-exec):   2050K .......... .......... .......... .......... .......... 44%  229M 0s
module.sbeacon.null_resource.init_script (local-exec):   2100K .......... .......... .......... .......... .......... 46%  281M 0s
module.sbeacon.null_resource.init_script (local-exec):   2150K .......... .......... .......... .......... .......... 47%  106M 0s
module.sbeacon.null_resource.init_script (local-exec):   2200K .......... .......... .......... .......... .......... 48%  120M 0s
module.sbeacon.null_resource.init_script (local-exec):   2250K .......... .......... .......... .......... .......... 49% 47.2M 0s
module.sbeacon.null_resource.init_script (local-exec):   2300K .......... .......... .......... .......... .......... 50%  220M 0s
module.sbeacon.null_resource.init_script (local-exec):   2350K .......... .......... .......... .......... .......... 51%  213M 0s
module.sbeacon.null_resource.init_script (local-exec):   2400K .......... .......... .......... .......... .......... 52%  281M 0s
module.sbeacon.null_resource.init_script (local-exec):   2450K .......... .......... .......... .......... .......... 53%  148M 0s
module.sbeacon.null_resource.init_script (local-exec):   2500K .......... .......... .......... .......... .......... 54%  125M 0s
module.sbeacon.null_resource.init_script (local-exec):   2550K .......... .......... .......... .......... .......... 55%  147M 0s
module.sbeacon.null_resource.init_script (local-exec):   2600K .......... .......... .......... .......... .......... 56%  260M 0s
module.sbeacon.null_resource.init_script (local-exec):   2650K .......... .......... .......... .......... .......... 57%  153M 0s
module.sbeacon.null_resource.init_script (local-exec):   2700K .......... .......... .......... .......... .......... 58%  116M 0s
module.sbeacon.null_resource.init_script (local-exec):   2750K .......... .......... .......... .......... .......... 59%  193M 0s
module.sbeacon.null_resource.init_script (local-exec):   2800K .......... .......... .......... .......... .......... 61%  167M 0s
module.sbeacon.null_resource.init_script (local-exec):   2850K .......... .......... .......... .......... .......... 62%  248M 0s
module.sbeacon.null_resource.init_script (local-exec):   2900K .......... .......... .......... .......... .......... 63%  161M 0s
module.sbeacon.null_resource.init_script (local-exec):   2950K .......... .......... .......... .......... .......... 64%  153M 0s
module.sbeacon.null_resource.init_script (local-exec):   3000K .......... .......... .......... .......... .......... 65%  192M 0s
module.sbeacon.null_resource.init_script (local-exec):   3050K .......... .......... .......... .......... .......... 66%  265M 0s
module.sbeacon.null_resource.init_script (local-exec):   3100K .......... .......... .......... .......... .......... 67%  167M 0s
module.sbeacon.null_resource.init_script (local-exec):   3150K .......... .......... .......... .......... .......... 68%  146M 0s
module.sbeacon.null_resource.init_script (local-exec):   3200K .......... .......... .......... .......... .......... 69%  213M 0s
module.sbeacon.null_resource.init_script (local-exec):   3250K .......... .......... .......... .......... .......... 70%  202M 0s
module.sbeacon.null_resource.init_script (local-exec):   3300K .......... .......... .......... .......... .......... 71%  255M 0s
module.sbeacon.null_resource.init_script (local-exec):   3350K .......... .......... .......... .......... .......... 72%  183M 0s
module.sbeacon.null_resource.init_script (local-exec):   3400K .......... .......... .......... .......... .......... 73%  155M 0s
module.sbeacon.null_resource.init_script (local-exec):   3450K .......... .......... .......... .......... .......... 74%  211M 0s
module.sbeacon.null_resource.init_script (local-exec):   3500K .......... .......... .......... .......... .......... 76%  369M 0s
module.sbeacon.null_resource.init_script (local-exec):   3550K .......... .......... .......... .......... .......... 77%  148M 0s
module.sbeacon.null_resource.init_script (local-exec):   3600K .......... .......... .......... .......... .......... 78%  230M 0s
module.sbeacon.null_resource.init_script (local-exec):   3650K .......... .......... .......... .......... .......... 79%  197M 0s
module.sbeacon.null_resource.init_script (local-exec):   3700K .......... .......... .......... .......... .......... 80%  230M 0s
module.sbeacon.null_resource.init_script (local-exec):   3750K .......... .......... .......... .......... .......... 81%  249M 0s
module.sbeacon.null_resource.init_script (local-exec):   3800K .......... .......... .......... .......... .......... 82%  210M 0s
module.sbeacon.null_resource.init_script (local-exec):   3850K .......... .......... .......... .......... .......... 83%  224M 0s
module.sbeacon.null_resource.init_script (local-exec):   3900K .......... .......... .......... .......... .......... 84%  232M 0s
module.sbeacon.null_resource.init_script (local-exec):   3950K .......... .......... .......... .......... .......... 85%  225M 0s
module.sbeacon.null_resource.init_script (local-exec):   4000K .......... .......... .......... .......... .......... 86%  276M 0s
module.sbeacon.null_resource.init_script (local-exec):   4050K .......... .......... .......... .......... .......... 87% 8.67M 0s
module.sbeacon.null_resource.init_script (local-exec):   4100K .......... .......... .......... .......... .......... 88%  252M 0s
module.sbeacon.null_resource.init_script (local-exec):   4150K .......... .......... .......... .......... .......... 89%  286M 0s
module.sbeacon.null_resource.init_script (local-exec):   4200K .......... .......... .......... .......... .......... 91%  247M 0s
module.sbeacon.null_resource.init_script (local-exec):   4250K .......... .......... .......... .......... .......... 92%  298M 0s
module.sbeacon.null_resource.init_script (local-exec):   4300K .......... .......... .......... .......... .......... 93%  252M 0s
module.sbeacon.null_resource.init_script (local-exec):   4350K .......... .......... .......... .......... .......... 94%  252M 0s
module.sbeacon.null_resource.init_script (local-exec):   4400K .......... .......... .......... .......... .......... 95%  265M 0s
module.sbeacon.null_resource.init_script (local-exec):   4450K .......... .......... .......... .......... .......... 96%  289M 0s
module.sbeacon.null_resource.init_script (local-exec):   4500K .......... .......... .......... .......... .......... 97%  335M 0s
module.sbeacon.null_resource.init_script (local-exec):   4550K .......... .......... .......... .......... .......... 98% 68.7M 0s
module.sbeacon.null_resource.init_script (local-exec):   4600K .......... .......... .......... .......... .......... 99%  256M 0s
module.sbeacon.null_resource.init_script (local-exec):   4650K .......... .........                                  100%  321M=0.1s

module.sbeacon.null_resource.init_script (local-exec): 2025-06-19 09:30:38 (38.0 MB/s) - ‘htslib-1.21.tar.bz2’ saved [4781943/4781943]

module.sbeacon.null_resource.init_script (local-exec): + tar -xf htslib-1.21.tar.bz2
module.pgxflow[0].aws_api_gateway_rest_api.PgxApi: Creation complete after 1s [id=cy0g8gkrzd]
module.pgxflow[0].aws_s3_bucket.pgxflow-bucket: Creating...
module.pgxflow[0].null_resource.init_script (local-exec): Submodule 'htscodecs' (https://github.com/samtools/htscodecs.git) registered for path 'htscodecs'
module.pgxflow[0].null_resource.init_script (local-exec): Cloning into '/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/libraries/source/htslib/htscodecs'...
module.pgxflow[0].aws_cloudfront_origin_request_policy.api: Creation complete after 2s [id=e394de6d-03ca-444a-973d-11b72fef4a46]
module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0]: Creation complete after 0s [id=2514280d852430c145c51eb74a20ca005f1156aa]
module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0]: Creation complete after 0s [id=57f11b382975668e11a3d3d4e3c32f524b30a549]
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creation complete after 0s [id=a87e34e98182d52df2c0e6ead83b7a324d26bc30]
module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0]: Creation complete after 0s [id=f9b54682fcc1fbb4defbf72abc401632b23bd1c3]
module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-updateFiles.local_file.archive_plan[0]: Creation complete after 0s [id=2d4b303a6488c5843c2643851e25655c98ce8f53]
module.pgxflow[0].aws_cloudfront_cache_policy.api: Creation complete after 2s [id=66268527-2cd7-4c61-b379-cd7acb8c7009]
module.sbeacon.module.lambda-indexer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-indexer.local_file.archive_plan[0]: Creation complete after 0s [id=d3379645d32b203828200e4304198b3d4b5e62b8]
module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0]: Creation complete after 0s [id=88fa436c4c397cbad41be2744c91f1d0665a895b]
module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0]: Creation complete after 0s [id=1d294e7678fd787752bfb461a9ae5b3f509ea071]
module.sbeacon.module.lambda-performQuery.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-performQuery.local_file.archive_plan[0]: Creation complete after 0s [id=dcbd821a0ab528d26b56d9695dabe68b49f81027]
module.sbeacon.module.lambda-getMap.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getMap.local_file.archive_plan[0]: Creation complete after 0s [id=1f65e1af79d7fa7cfce68a996300963bf3e1e54f]
module.cognito.module.lambda-customMessageLambdaTrigger.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getProjects.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.local_file.archive_plan[0]: Creation complete after 0s [id=8307d3fe51d83b7a6ac4c8de8e43c6978e740835]
module.cognito.module.lambda-sendRegistrationEmail.local_file.archive_plan[0]: Creation complete after 0s [id=90e1bebd010f41f3ac4173cffd0d1695ad20f969]
module.sbeacon.module.lambda-getProjects.local_file.archive_plan[0]: Creation complete after 0s [id=13f242f5af2fb58e66c2311f2b2419bbc6de7572]
module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.local_file.archive_plan[0]: Creating...
module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0]: Creation complete after 0s [id=176676d28396618f60da1352763e7b680c2bb866]
module.sbeacon.module.lambda-generateCohortVCfs.local_file.archive_plan[0]: Creation complete after 0s [id=e88e3b04679387c6027e55394d0f7ee2c1f227dd]
module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0]: Creation complete after 0s [id=db33ee8c0eaf0bfd3ae77199a22257c5fe90f6cd]
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0]: Creation complete after 0s [id=7dcd38d3dc4bf5078c57a3709a0add20ec58ed1c]
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=98d043aa0e6f5d353017f388f347ccb0a6825ba7]
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-splitQuery.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=41d0b40c5914d342b2748341234f08b97826747c]
module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0]: Creation complete after 0s [id=56eeaab5cf5eba7b6a1563323e3bf2f5cbc4cc3b]
module.sbeacon.module.lambda-splitQuery.local_file.archive_plan[0]: Creation complete after 0s [id=ca01b7a78d2ec65f2af41c993e577cd88451a486]
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=1c4279b54171c4c9bdda269a7d8c246f967cd868]
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=0d77ea0041effaf8af2efd2129ab59145d4379b1]
module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=d2bb509a2301fa71399ddf9e4c0f9ea275ad8dfa]
module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0]: Creation complete after 0s [id=955873705c1d653a738c7e094008b93e1e160f0b]
module.cognito.module.lambda-sendClinicJobEmail.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.local_file.archive_plan[0]: Creation complete after 0s [id=587114a9e0200b8b6feddf9b4ea05085405c848f]
module.sbeacon.null_resource.init_script (local-exec): + cd htslib-1.21
module.sbeacon.null_resource.init_script (local-exec): + autoreconf
module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0]: Creation complete after 0s [id=f8260f5af56fb4eb307e8963a1b0365e6b9d460a]
module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0]: Creating...
module.pgxflow[0].aws_s3_bucket.pgxflow-references: Creation complete after 2s [id=pgxflow-backend-references-20250619023037268600000002]
module.cognito.aws_ses_configuration_set.ses_feedback_config: Creating...
module.pgxflow[0].aws_s3_bucket.lambda-layers-bucket: Creation complete after 2s [id=pgxflow-backend-layers-20250619023037267500000001]
module.cognito.aws_sns_topic.sesDeliveryLogger: Creating...
module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/cognito-logEmailDelivery]
module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/cognito-sendRegistrationEmail]
module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/cognito-customMessageLambdaTrigger]
module.webgui.aws_cloudfront_origin_access_control.bui-s3-distribution: Creating...
module.webgui.aws_s3_bucket.bui-hosted-bucket: Creating...
module.sbeacon.aws_dynamodb_table.sbeacon-dataportal-users-quota: Creating...
module.cognito.aws_ses_configuration_set.ses_feedback_config: Creation complete after 0s [id=ses-feedback-config]
module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0]: Creation complete after 2s [id=security-sendSecurityAlert]
module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0]: Creating...
module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache: Creating...
module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/cognito-sendClinicJobEmail]
module.sbeacon.module.lambda-performQuery.aws_cloudwatch_log_group.lambda[0]: Creating...
module.cognito.aws_sns_topic.sesDeliveryLogger: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:438465168484:sesDeliveryLogger]
module.sbeacon.aws_dynamodb_table.clinical_variants: Creating...
module.sbeacon.module.lambda-performQuery.aws_cloudwatch_log_group.lambda[0]: Creation complete after 0s [id=/aws/lambda/sbeacon-backend-performQuery]
module.sbeacon.aws_dynamodb_table.descendant_terms: Creating...
module.pgxflow[0].aws_s3_bucket.pgxflow-bucket: Creation complete after 2s [id=pgxflow-backend-20250619023038383000000003]
module.sbeacon.aws_dynamodb_table.saved_queries: Creating...
module.webgui.aws_cloudfront_origin_access_control.bui-s3-distribution: Creation complete after 1s [id=E2P4LP2ML363P4]
module.sbeacon.aws_dynamodb_table.juptyer_notebooks: Creating...
module.webgui.aws_s3_bucket.bui-hosted-bucket: Creation complete after 2s [id=webgui-bucket-20250619023039049500000001]
module.sbeacon.aws_dynamodb_table.projects: Creating...
module.pgxflow[0].null_resource.init_script (local-exec): Submodule path 'htscodecs': checked out 'ce66e5f303862aad325e4df908636a31c877b4d8'
module.pgxflow[0].null_resource.init_script (local-exec): + cd htslib
module.pgxflow[0].null_resource.init_script (local-exec): + autoreconf
module.sbeacon.null_resource.init_script (local-exec): + ./configure --enable-libcurl
module.sbeacon.null_resource.init_script (local-exec): checking for gcc... gcc
module.sbeacon.null_resource.init_script (local-exec): checking whether the C compiler works... yes
module.sbeacon.null_resource.init_script (local-exec): checking for C compiler default output file name... a.out
module.sbeacon.null_resource.init_script (local-exec): checking for suffix of executables...
module.sbeacon.null_resource.init_script (local-exec): checking whether we are cross compiling... no
module.sbeacon.null_resource.init_script (local-exec): checking for suffix of object files... o
module.sbeacon.null_resource.init_script (local-exec): checking whether we are using the GNU C compiler... yes
module.sbeacon.null_resource.init_script (local-exec): checking whether gcc accepts -g... yes
module.sbeacon.null_resource.init_script (local-exec): checking for gcc option to accept ISO C89... none needed
module.sbeacon.null_resource.init_script (local-exec): checking for ranlib... ranlib
module.sbeacon.null_resource.init_script (local-exec): checking for grep that handles long lines and -e... /usr/bin//grep
module.sbeacon.null_resource.init_script (local-exec): checking for C compiler warning flags... -Wall
module.sbeacon.null_resource.init_script (local-exec): checking how to run the C preprocessor... gcc -E
module.sbeacon.null_resource.init_script (local-exec): checking for egrep... /usr/bin//grep -E
module.sbeacon.null_resource.init_script (local-exec): checking for ANSI C header files...
module.sbeacon.null_resource.init_script (local-exec): yes
module.sbeacon.null_resource.init_script (local-exec): checking for sys/types.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for sys/stat.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for stdlib.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for string.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for memory.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for strings.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for inttypes.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for stdint.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking for unistd.h... yes
module.sbeacon.null_resource.init_script (local-exec): checking whether _XOPEN_SOURCE is declared... no
module.sbeacon.null_resource.init_script (local-exec): checking whether __get_cpuid_max is declared... yes
module.sbeacon.null_resource.init_script (local-exec): checking whether __cpuid_count is declared... yes
module.sbeacon.null_resource.init_script (local-exec): checking C compiler flags needed for sse4.1...
module.sbeacon.null_resource.init_script (local-exec): none
module.sbeacon.null_resource.init_script (local-exec): checking C compiler flags needed for avx2...
module.sbeacon.null_resource.init_script (local-exec): -mavx2 -mpopcnt
module.sbeacon.null_resource.init_script (local-exec): checking C compiler flags needed for avx512f...
module.pgxflow[0].null_resource.init_script (local-exec): + ./configure --enable-libcurl
module.pgxflow[0].null_resource.init_script (local-exec): checking for gcc... gcc
module.pgxflow[0].null_resource.init_script (local-exec): checking whether the C compiler works... yes
module.pgxflow[0].null_resource.init_script (local-exec): checking for C compiler default output file name... a.out
module.pgxflow[0].null_resource.init_script (local-exec): checking for suffix of executables...
module.pgxflow[0].null_resource.init_script (local-exec): checking whether we are cross compiling... no
module.pgxflow[0].null_resource.init_script (local-exec): checking for suffix of object files... o
module.sbeacon.null_resource.init_script (local-exec): -mavx512f -mpopcnt
module.pgxflow[0].null_resource.init_script (local-exec): checking whether we are using the GNU C compiler... yes
module.pgxflow[0].null_resource.init_script (local-exec): checking whether gcc accepts -g... yes
module.sbeacon.null_resource.init_script (local-exec): checking for working __builtin_cpu_supports("ssse3")... yes
module.sbeacon.null_resource.init_script (local-exec): checking for __attribute__((target))... yes
module.pgxflow[0].null_resource.init_script (local-exec): checking for gcc option to accept ISO C89... none needed
module.pgxflow[0].null_resource.init_script (local-exec): checking for ranlib... ranlib
module.sbeacon.null_resource.init_script (local-exec): checking for pkg-config... /usr/bin//pkg-config
module.pgxflow[0].null_resource.init_script (local-exec): checking for grep that handles long lines and -e... /usr/bin//grep
module.sbeacon.null_resource.init_script (local-exec): checking pkg-config is at least version 0.9.0... yes
module.sbeacon.null_resource.init_script (local-exec): checking for special C compiler options needed for large files... no
module.pgxflow[0].null_resource.init_script (local-exec): checking for C compiler warning flags... -Wall
module.sbeacon.null_resource.init_script (local-exec): checking for _FILE_OFFSET_BITS value needed for large files... no
module.sbeacon.null_resource.init_script (local-exec): checking shared library type for unknown-Linux... plain .so
module.pgxflow[0].null_resource.init_script (loca
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.